-- +goose Up
CREATE TABLE plan (
  id SERIAL PRIMARY KEY NOT NULL,
  name VARCHAR(255) UNIQUE NOT NULL,
  user_id INT NOT NULL REFERENCES users (id),
  topic VARCHAR(255) NOT NULL,
  topic_en VARCHAR(255) NOT NULL,
  topic_short VARCHAR(64) NOT NULL,
  readiness_willingness TEXT,
  readiness_willingness_updated_at TIMESTAMP WITH TIME ZONE DEFAULT now() NOT NULL,
  readiness_willingness_updated_by VARCHAR(16),
  ir_goal_type VARCHAR(64),
  ir_goal_type_updated_at TIMESTAMP WITH TIME ZONE DEFAULT now() NOT NULL,
  ir_goal_type_updated_by VARCHAR(16),
  ir_goal_details TEXT,
  ir_goal_details_updated_at TIMESTAMP WITH TIME ZONE DEFAULT now() NOT NULL,
  ir_goal_details_updated_by VARCHAR(16),
  proposed_activity TEXT,
  proposed_activity_updated_at TIMESTAMP WITH TIME ZONE DEFAULT now() NOT NULL,
  proposed_activity_updated_by VARCHAR(16),
  plan_note TEXT,
  plan_note_updated_at TIMESTAMP WITH TIME ZONE DEFAULT now() NOT NULL,
  plan_note_updated_by VARCHAR(16),
  contact_person TEXT,
  contact_person_updated_at TIMESTAMP WITH TIME ZONE DEFAULT now() NOT NULL,
  contact_person_updated_by VARCHAR(16),
  created_at TIMESTAMP WITH TIME ZONE DEFAULT now() NOT NULL,
  updated_at TIMESTAMP WITH TIME ZONE DEFAULT now() NOT NULL,
  updated_by VARCHAR(16),
  for_admin BOOLEAN DEFAULT false
);

INSERT 
INTO plan (
  name, user_id, topic, topic_en, topic_short, readiness_willingness, readiness_willingness_updated_by,
  ir_goal_type, ir_goal_type_updated_by, ir_goal_details, ir_goal_details_updated_by,
  proposed_activity, proposed_activity_updated_by, plan_note, plan_note_updated_by,
  contact_person, contact_person_updated_by, updated_by
) 
VALUES 
('PLAN1', 1, 'แผนควบคุมยาสูบ', 'Tobacco Control', 'Tobacco',
'ready 1',  'user', 'type_1',  'user', 
'เสริมสร้างการผลักดันนโยบายระดับชาติของประเทศไทยในการควบคุมยาสูบ ผ่านการบูรณาการแนวทางการควบคุมยาสูบจากทั่วโลก และเสริมสร้างการปฏิบัติตามอนุสัญญาขององค์การอนามัยโลกว่าด้วยการควบคุมยาสูบ (WHO FCTC) โดยเน้นที่ความท้าทายใหม่ ๆ เช่น บุหรี่ไฟฟ้า',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>การติดตามนโยบายและการวิเคราะห์เชิงกลยุทธ์ :</strong> ติดตามนโยบายการควบคุมยาสูบทั่วโลกอย่างสม่ำเสมอ โดยเน้นที่การพัฒนาที่เกี่ยวข้องกับบุหรี่ไฟฟ้า วิเคราะห์แนวโน้ม และแนวทางในการควบคุมจากนานาประเทศเพื่อปรับปรุงการวางแผนในเชิงกลยุทธ์ เพื่อสนับสนุนแนวทางในการพัฒนาของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ</li>
<li dir="ltr" role="presentation"><strong>ความร่วมมือระหว่างประเทศและการแลกเปลี่ยนความรู้ :</strong> เข้าร่วมเครือข่ายและพันธมิตรการควบคุมยาสูบระหว่างประเทศ เพื่อแลกเปลี่ยนข้อมูลเชิงลึกเกี่ยวกับกลยุทธ์ในการกำกับดูแลและการควบคุมบุหรี่ไฟฟ้าอย่างมีประสิทธิภาพ</li>
<li dir="ltr" role="presentation"><strong>การวิจัยเพื่อเปรียบเทียบนโยบาย :</strong> ใช้ประโยชน์จากความร่วมมือระหว่างประเทศของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ ในการวิจัยเปรียบเทียบนโยบายบุหรี่ไฟฟ้าและประสิทธิผลของนโยบายนั้น ๆ ในการปรับปรุงสุขภาพของประชาชน และใช้ผลการวิจัยเหล่านี้เพื่อสนับสนุนการตัดสินใจเชิงนโยบายโดยอิงหลักฐานในประเทศไทย</li>
<li dir="ltr" role="presentation"><strong>การปรับใช้แนวปฏิบัติที่ดีที่สุด :</strong> ระบุและปรับใช้กลยุทธ์การควบคุมยาสูบที่ประสบความสำเร็จจากทั่วโลก โดยปรับให้เหมาะสมกับบริบทและสภาพแวดล้อมที่มีลักษณะเฉพาะของประเทศไทย</li>
<li dir="ltr" role="presentation"><strong id="docs-internal-guid-f5fde012-7fff-d61b-a1d5-03ec754975b6">การผลักดันและการปฏิบัติตาม FCTC :</strong> ผลักดันการปฏิบัติตามแนวทางของ FCTC ในระดับประเทศ โดยมุ่งเน้นไปที่การควบคุมบุหรี่ไฟฟ้า และผลิตภัณฑ์ยาสูบใหม่ ๆ</li>
</ol>', 'user',
'plan note 1',  'user', 'contact 1',  'user', 'user'),

('PLAN2', 2, 'แผนควบคุมเครื่องดื่มแอลกอฮอล์และสิ่งเสพติด', 'Alcohol and Substance Abuse Control', 'Alcohol',
'ready 2',  'user', 'type_1',  'user', 
'จัดตั้งและเสริมสร้างเครือข่ายระดับภูมิภาคเพื่อการควบคุมเครื่องดื่มแอลกอฮอล์ในทวีปเอเชีย โดยมุ่งเน้นให้ประเทศไทยเป็นผู้นำในการส่งเสริมความร่วมมือ การแลกเปลี่ยนแนวทางในการปฏิบัติ และการผลักดันนโยบายการควบคุมเครื่องดื่มแอลกอฮอล์ให้มีประสิทธิภาพทั่วทั้งภูมิภาค',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>ความร่วมมือระดับภูมิภาคและการผลักดันนโยบาย :</strong> อำนวยความสะดวกในการสร้างกรอบความร่วมมือระหว่างประเทศต่าง ๆ ในทวีปเอเชีย เพื่อจัดการกับปัญหาที่เกี่ยวข้องกับเครื่องดื่มแอลกอฮอล์ นอกจากนี้จะผลักดันการยอมรับนโยบายการควบคุมเครื่องดื่มแอลกอฮอล์ที่ครอบคลุมซึ่งสอดคล้องกับมาตรฐานในระดับสากล พร้อมกับคำนึงถึงความอ่อนไหวทางวัฒนธรรมในท้องถิ่นของประเทศต่าง ๆ&nbsp;</li>
<li dir="ltr" role="presentation"><strong>การพัฒนาศักยภาพและการฝึกอบรม :</strong> วางแผนจัดในการจัดการอบรมเพื่อพัฒนาศักยภาพประจำปี ให้กับสมาชิกเครือข่าย โดยมุ่งเน้นไปที่การพัฒนานโยบาย กลยุทธ์ การสนับสนุน และเทคนิคการมีส่วนร่วมของชุมชน นอกจากนี้จะมีการพัฒนาหลักสูตรการฝึกอบรม ที่รวมถึงการให้ความรู้เกี่ยวกับการบังคับใช้กฎระเบียบที่เกี่ยวกับเครื่องดื่มแอลกอฮอล์อย่างมีประสิทธิภาพ รวมทั้งรณรงค์ด้านสาธารณสุข และสร้างการมีส่วนร่วมกับชุมชนเครือข่าย</li>
<li dir="ltr" role="presentation"><strong>การแลกเปลี่ยนความรู้และแนวปฏิบัติที่ดี :</strong> สร้างแพลตฟอร์มดิจิทัลสำหรับการแลกเปลี่ยนความรู้ ซึ่งประเทศต่าง ๆ สามารถแบ่งปันข้อมูล ข้อค้นพบจากการวิจัย และกรณีศึกษาที่ประสบความสำเร็จลงในแพลตฟอร์มดังกล่าวได้ รวมทั้งจัดการประชุมวิชาการปีละ 2 ครั้ง เพื่อเสนอความก้าวหน้าในนโยบายการควบคุมเครื่องดื่มแอลกอฮอล์ หารือเกี่ยวกับความท้าทายใหม่ ๆ&nbsp; และสำรวจแนวทางแก้ไขปัญหาที่เป็นนวัตกรรมใหม่ที่จะนำมาปรับใช้ในทวีปเอเชีย</li>
<li dir="ltr" role="presentation"><strong>การวิจัยและการวิเคราะห์เชิงเปรียบเทียบ :</strong> ริเริ่มโครงการวิจัยเพื่อประเมินประสิทธิภาพและผลลัพธ์ของนโยบายการควบคุมเครื่องดื่มแอลกอฮอล์ที่มีอยู่ในประเทศต่าง ๆ ในทวีปเอเชีย โดยจะทำการวิเคราะห์เชิงเปรียบเทียบเพื่อระบุแนวปฏิบัติที่ดี และมีประสิทธิภาพ จากนั้นจึงปรับให้เหมาะสมกับบริบทของแต่ละประเทศในภูมิภาคเอเชีย</li>
<li dir="ltr" role="presentation"><strong>การติดตามและประเมินผล :</strong> ดำเนินการติดตามผลการดำเนินงานอย่างเข้มงวด เพื่อประเมินความก้าวหน้าของกิจกรรมเครือข่าย และศึกษาถึงผลกระทบของนโยบายที่นำมาใช้ในการควบคุมเครื่องดื่มแอลกอฮอล์ทั่วภูมิภาค โดยจะมีการประเมินประสิทธิภาพของโครงการในเครือข่ายทุกปี และจะมีการปรับกลยุทธ์ให้เหมาะสมเพื่อเพิ่มผลลัพธ์ที่ดี</li>
<li dir="ltr" role="presentation"><strong>การรณรงค์สร้างความตระหนักรู้ในสาธารณชน :</strong> เปิดตัวการรณรงค์สร้างความตระหนักรู้ในระดับภูมิภาคเพื่อให้ความรู้แก่ประชาชนเกี่ยวกับความเสี่ยงที่เกิดขึ้นจากการใช้เครื่องดื่มแอลกอฮอล์ และส่งเสริมแนวทางในการปฏิบัติเพื่อสร้างสุขภาพที่ดี โดยจะร่วมมือกับสื่อท้องถิ่น และสื่อมวลชนเพื่อนำเสนอข้อมูลและเข้าถึงกลุ่มเป้าหมายได้มากยิ่งขึ้น</li>
</ol>', 'user',
'plan note 2',  'user', 'contact 2',  'user', 'user'),

('PLAN3', 3, 'แผนการจัดการความปลอดภัย และปัจจัยเสี่ยงทางสังคม', 'Road Safety and Social Risk Management Plan', 'Road Safety',
'ready 3',  'user', 'type_1',  'user', 
'เสริมสร้างความเชี่ยวชาญของเจ้าหน้าที่สำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ เพื่อสนับสนุนและแลกเปลี่ยนกับภาคีเครือข่ายระดับนานาชาติเพื่อริเริ่มงานด้านความปลอดภัยบนท้องถนน โดยนำแนวทางในการปฏิบัติที่ได้รับการยอมรับในระดับสากลมาปรับใช้ และส่งเสริมการแลกเปลี่ยนความรู้ซึ่งกันละกัน',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>การประเมินทักษะและความรู้ :</strong> ดำเนินการประเมินความสามารถของเจ้าหน้าที่ภายในสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพเกี่ยวกับความรู้ในแนวทางปฏิบัติ และความคิดริเริ่มในงานด้านของความปลอดภัยบนท้องถนนจากทั่วโลก</li>
<li dir="ltr" role="presentation"><strong>โครงการเสริมสร้างศักยภาพที่ตรงเป้าหมาย :</strong> พัฒนาและส่งเสริมการฝึกอบรมเฉพาะทางที่มุ่งเน้นไปที่ความร่วมมือระหว่างประเทศ</li>
<li dir="ltr" role="presentation"><strong>โครงการแลกเปลี่ยนความรู้ :</strong> อํานวยความสะดวกระหว่างเจ้าหน้าที่ของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพและผู้เชี่ยวชาญด้านความปลอดภัยทางถนนระดับโลก ผ่านเวิร์กช็อป สัมมนา และโปรแกรมการให้คำปรึกษา</li>
<li dir="ltr" role="presentation"><strong>การมีส่วนร่วมของภาคีเครือข่ายทั่วโลก :</strong> สนับสนุนให้เจ้าหน้าที่ของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพในการเข้าร่วมและเสริมสร้างภาคีเครือข่ายพันธมิตรด้านความปลอดภัยทางถนนระหว่างประเทศ</li>
<li dir="ltr" role="presentation"><strong>ระบบการแลกเปลี่ยนและแบ่งปันประสบการณ์ :</strong> สร้างกลไกให้เจ้าหน้าที่ของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพสามารถแบ่งปันข้อมูลเชิงลึก ความท้าทายในการทำงาน และกลยุทธ์ที่ทำให้งานหรือกิจกรรมประสบความสำเร็จกับภาคีเครือข่ายระดับโลกอย่างสม่ำเสมอ</li>
<li dir="ltr" role="presentation"><strong>สร้างโอกาสในการช่วยเหลือด้านเทคนิค :</strong> สร้างโอกาสให้เจ้าหน้าที่ของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพในการให้การสนับสนุนด้านเทคนิคแก่ภาคีเครือข่าย โดยใช้ทักษะและความรู้ที่เกี่ยวกับการปฏิบัติงานระหว่างประเทศ</li>
<li dir="ltr" role="presentation"><strong>การติดตามและประเมินผล :</strong> ประเมินผลกิจกรรมเสริมสร้างศักยภาพต่อโครงการที่สำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพให้การสนับสนุน โดยใช้ข้อมูลเชิงลึกเพื่อปรับปรุงกลยุทธ์และแผนการดำเนินงาน</li>
</ol>', 'user',
'plan note 3',  'user', 'contact 3',  'user', 'user'),

('PLAN4', 4, 'แผนควบคุมปัจจัยเสี่ยงทางสุขภาพ', 'Health Risk Control Plan', 'Health Risk',
'ready 4',  'user', 'type_1',  'user', 
'เสริมสร้างศักยภาพของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพในการส่งเสริมสุขภาพจิตอย่างมีประสิทธิภาพ โดยนําความรู้ แนวปฏิบัติที่ดี และนวัตกรรมในระดับสากลมาใช้ รวมทั้งพัฒนาทักษะและความสามารถของเจ้าหน้าที่สำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพและภาคีเครือข่าย',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>การทบทวนความรู้ระหว่างประเทศ :</strong> ดำเนินการศึกษาถึงกรณีศึกษาระหว่างประเทศ และแนวทางปฏิบัติด้านสุขภาพจิตที่มีความครอบคลุม เพื่อนำข้อมูลเชิงลึกมาใช้กับการปฏิบัติงานของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ</li>
<li dir="ltr" role="presentation"><strong>การพัฒนากรอบกลยุทธ์ :</strong> พัฒนากรอบกลยุทธ์ความรู้ด้านสุขภาพจิตระหว่างประเทศ โดยระบุลำดับความสำคัญพื้นที่ปฏิบัติการ และกลไกการบูรณาการความรู้ดังกล่าว</li>
<li dir="ltr" role="presentation"><strong>สร้างความร่วมมือระดับโลก :</strong> สร้างความร่วมมือกับองค์กรสุขภาพจิตชั้นนําในระดับนานาชาติ ผู้เชี่ยวชาญ รวมทั้งภาคีเครือข่ายเพื่อแลกเปลี่ยนความรู้ซึ่งกันและกัน</li>
<li dir="ltr" role="presentation"><strong>โครงการเสริมสร้างศักยภาพ :</strong> ออกแบบและดำเนินโครงการฝึกอบรมที่ตรงกับเป้าหมายสำหรับเจ้าหน้าที่และภาคีเครือข่ายของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ โดยมุ่งเน้นไปที่แนวทางปฏิบัติที่ดีในระดับสากล และแนวทางที่เป็นนวัตกรรมในการส่งเสริมสุขภาพจิต</li>
<li dir="ltr" role="presentation"><strong>การมีส่วนร่วมและการแบ่งปันระหว่างประเทศ :</strong> ส่งเสริมการมีส่วนร่วมในการประชุมและการประชุมเชิงปฏิบัติการด้านสุขภาพจิตระดับนานาชาติ และอํานวยความสะดวกในการแบ่งปันความรู้ที่สำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพมีอยู่</li>
<li dir="ltr" role="presentation"><strong>โครงการนําร่องและการประเมินผล :</strong> นําร่องโดยใช้การประยุกต์แนวทางปฏิบัติในระดับสากลในการริเริ่มโครงการด้านสุขภาพจิต ประเมินผล และใช้ผลการวิจัยเพื่อกำหนดและวางแผนกลยุทธ์ในอนาคต</li>
<li dir="ltr" role="presentation"><strong>การพัฒนาและผลิตชุดความรู้ :</strong> สร้างและเผยแพร่ชุดความรู้ที่บันทึกประสบการณ์และความสำเร็จของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพในการบูรณาการการปฏิบัติด้านสุขภาพจิตระหว่างประเทศและสร้างศักยภาพภายใน</li>
<li dir="ltr" role="presentation"><strong>การประเมินผลอย่างต่อเนื่อง:</strong> ติดตามและประเมินประสิทธิผลของกลยุทธ์ที่นำมาใช้อย่างสม่ำเสมอในการยกระดับการส่งเสริมสุขภาพจิตของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ และปรับเปลี่ยนแนวทางตามข้อเสนอแนะที่ได้รับ</li>
</ol>', 'user',
'plan note 4',  'user', 'contact 4',  'user', 'user'),

('PLAN5', 5, 'แผนสุขภาวะประชากรกลุ่มเฉพาะ', 'Health Promotion Plan for Vulnerable Populations', 'Vulnerable Populations',
'ready 5',  'user', 'type_1',  'user', 
'พัฒนาและปรับใช้การจัดการความรู้ที่ครอบคลุมเพื่อรวบรวม จัดระเบียบ และแบ่งปันแนวทางปฏิบัติที่ดีในการส่งเสริมสุขภาพสำหรับประชากรกลุ่มเปราะบางอย่างเป็นระบบ ซึ่งจะช่วยเพิ่มประสิทธิผลและการเข้าถึงกลุ่มเปราะบางของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>การทบทวนแนวทางปฏิบัติในปัจจุบันอย่างเป็นระบบ :</strong> ดำเนินการทบทวนเกี่ยวกับโครงการของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพที่มีอยู่ โดยกำหนดเป้าหมายไปยังประชากรกลุ่มเปราะบาง เพื่อสร้างกลยุทธ์ที่มีประสิทธิภาพ</li>
<li dir="ltr" role="presentation"><strong>รวบรวมข้อมูลเชิงลึกจากผู้มีส่วนได้ส่วนเสีย :</strong> ร่วมมือกับพันธมิตร ผู้มีส่วนได้ส่วนเสีย และผู้รับผลประโยชน์ เพื่อรวบรวมข้อมูลเชิงลึกและประสบการณ์ที่หลากหลาย ซึ่งจะเป็นส่วนสำคัญของการจัดการความรู้</li>
<li dir="ltr" role="presentation"><strong>การออกแบบชุดความรู้ที่ใช้งานง่าย :</strong> ออกแบบชุดการจัดการความรู้ให้สามารถเข้าถึงได้และเป็นมิตรกับผู้ใช้ เพื่อให้มั่นใจว่าง่ายต่อการใช้งาน การค้นหา และสามารถนําไปใช้โดยผู้มีส่วนได้ส่วนเสียต่าง ๆ อย่างมีประสิทธิภาพ</li>
<li dir="ltr" role="presentation"><strong>แผนการเผยแพร่เชิงกลยุทธ์ :</strong> พัฒนาและดำเนินการตามแผนกลยุทธ์เพื่อเผยแพร่ชุดความรู้ โดยกำหนดเป้าหมายไปยังกลุ่มเป้าหมายหลัก เช่น ผู้กำหนดนโยบาย ผู้ให้บริการด้านการดูแลสุขภาพ และองค์กรชุมชน</li>
<li dir="ltr" role="presentation"><strong>การประชุมเชิงปฏิบัติการและสัมมนาเสริมสร้างศักยภาพ :</strong> จัดการฝึกอบรมและการประชุมเชิงปฏิบัติการเพื่อแนะนําชุดความรู้ให้กับผู้มีส่วนได้ส่วนเสีย</li>
<li dir="ltr" role="presentation"><strong>ความช่วยเหลือและการสนับสนุนด้านเทคนิค :</strong> ให้การสนับสนุนและความช่วยเหลือด้านเทคนิคอย่างต่อเนื่องเพื่อส่งเสริมการนําแนวทางปฏิบัติที่ดีที่บันทึกไว้ในชุดความรู้โดยภาคีเครือข่ายระดับชาติและระดับท้องถิ่น</li>
<li dir="ltr" role="presentation"><strong>ปรับปรุงข้อมูลใหม่ ๆ อย่างสม่ำเสมอ :</strong> ปรับปรุงการจัดการความรู้อย่างสม่ำเสมอด้วยข้อมูลเชิงลึก ประสบการณ์ และแนวทางปฏิบัติใหม่ๆ ที่ได้จากการทำงานอย่างต่อเนื่องของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ</li>
<li dir="ltr" role="presentation"><strong>การติดตามและประเมินผล :</strong> ติดตามและประเมินผลของชุดความรู้ในด้านการส่งเสริมสุขภาพสำหรับประชากรกลุ่มเปราะบาง โดยใช้ข้อเสนอแนะที่ได้รับ เพื่อปรับปรุงชุดความรู้อย่างต่อเนื่อง</li>
<li dir="ltr" role="presentation"><strong>การแบ่งปันและความร่วมมือระหว่างประเทศ :</strong> แบ่งปันชุดความรู้และข้อมูลเชิงลึกจากการพัฒนาและการปฏิบัติงานกับภาคีเครือข่ายระดับนานาชาติ ซึ่งจะนําไปสู่ความรู้และแนวปฏิบัติระดับโลกในการส่งเสริมสุขภาพสำหรับประชากรกลุ่มเปราะบาง</li>
</ol>', 'user',
'plan note 5',  'user', 'contact 5',  'user', 'user'),

('PLAN6', 6, 'แผนสุขภาวะชุมชน', 'Healthy Community Strengthening Plan', 'Community',
'ready 6',  'user', 'type_1',  'user', 
'เสริมสร้างความเข้มแข็งให้กับชุมชนในประเทศไทยด้วยการนําความรู้ระหว่างประเทศมาปรับใช้ สร้างขีดความสามารถ และแบ่งปันแนวปฏิบัติระดับชาติในเวทีระหว่างประเทศ เพื่อยกระดับความสามารถในการส่งเสริมสุขภาพของชุมชน',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>ยกระดับระบบการจัดการความรู้ :</strong> พัฒนาและยกระดับระบบการจัดการความรู้ที่แข็งแกร่งซึ่งอํานวยความสะดวกในการรวบรวม วิเคราะห์ และเผยแพร่แนวทางปฏิบัติในการเสริมสร้างความเข้มแข็งของชุมชนที่มีประสิทธิภาพ ระบบนี้จะทำหน้าที่เป็นศูนย์กลางที่บุคลากรทางการแพทย์ และผู้นําชุมชนในประเทศไทยสามารถเข้าถึงได้</li>
<li dir="ltr" role="presentation"><strong>การเสริมสร้างศักยภาพระหว่างภาคีเครือข่าย :</strong> เสริมสร้างขีดความสามารถของภาคีเครือข่ายของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ รวมถึงผู้เชี่ยวชาญด้านการส่งเสริมสุขภาพ และผู้นําชุมชนผ่านโปรแกรมการฝึกอบรม การประชุมเชิงปฏิบัติการ และโครงการแลกเปลี่ยนที่มุ่งเน้นการนํา&nbsp; &nbsp; กลยุทธ์การส่งเสริมสุขภาพระหว่างประเทศไปใช้ในบริบทท้องถิ่น</li>
<li dir="ltr" role="presentation"><strong>การแสดงผลสำเร็จของการดำเนินงานในระดับนานาชาติ :</strong> จัดทำเอกสาร และแบ่งปันโครงการส่งเสริมสุขภาพชุมชนที่ประสบความสำเร็จของประเทศไทยในระดับสากลผ่านการประชุม และระบบการจัดการความรู้ เพื่อส่งเสริมการรับรู้และความร่วมมือระดับโลก</li>
</ol>', 'user',
'plan note 6',  'user', 'contact 6',  'user', 'user'),

('PLAN7', 7, 'แผนสุขภาวะเด็ก เยาวชน และครอบครัว', 'Healthy Child, Youth, and Family Promotion Plan', 'Child, Youth, and Family',
'ready 7', 'user', 'type_1',  'user', 
'ยกระดับกลยุทธ์การส่งเสริมสุขภาพสำหรับเด็ก เยาวชน และครอบครัว โดยบูรณาการแนวโน้มที่นานาชาติให้ความสนใจ รวมทั้งแนวปฏิบัติที่เหมาะสมไว้ในแผนปฏิบัติการของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>การวิเคราะห์แนวโน้มโลก :</strong> ดำเนินการวิจัยเพื่อระบุและทำความเข้าใจแนวโน้มระหว่างประเทศในปัจจุบัน รวมทั้งกลยุทธ์ที่ประสบความสำเร็จในการส่งเสริมสุขภาพสำหรับเด็ก เยาวชน และครอบครัว</li>
<li dir="ltr" role="presentation"><strong>การบูรณาการแนวปฏิบัติที่เหมาะสม :</strong> ปรับและบูรณาการแนวปฏิบัติระหว่างประเทศที่ระบุไว้เข้ากับโครงการส่งเสริมสุขภาพที่มีอยู่ รวมทั้งในโครงการใหม่ของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ โดยปรับให้เข้ากับบริบททางวัฒนธรรม และสังคมของประเทศไทย</li>
<li dir="ltr" role="presentation"><strong>ส่งเสริมความร่วมมือของผู้มีส่วนได้ส่วนเสีย :</strong> ส่งเสริมความร่วมมือกับองค์กรด้านสุขภาพระหว่างประเทศและผู้เชี่ยวชาญเพื่อปรับปรุงกลยุทธ์ด้านการส่งเสริมสุขภาพอย่างต่อเนื่อง</li>
<li dir="ltr" role="presentation"><strong>การฝึกอบรมและเสริมสร้างศักยภาพ :</strong> พัฒนาและจัดทำโครงการการฝึกอบรมสำหรับเจ้าหน้าที่และภาคีเครือข่ายของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพ เพื่อเพิ่มความเข้าใจ และพัฒนาทักษะการนําแนวปฏิบัติและนวัตกรรมระหว่างประเทศใหม่ๆ ในการส่งเสริมสุขภาพไปปรับใช้</li>
<li dir="ltr" role="presentation"><strong>โครงการนําร่อง :</strong> ดำเนินโครงการนําร่องตามแนวปฏิบัติระหว่างประเทศแบบบูรณาการ เพื่อทดสอบประสิทธิภาพและประสิทธิผลในบริบทของประเทศไทย</li>
<li dir="ltr" role="presentation"><strong>กลไกการประเมินและข้อเสนอแนะ :</strong> สร้างระบบที่เข้มแข็งหรับการติดตามและประเมินผลกลยุทธ์ที่จะนําไปใช้ เพื่อให้มั่นใจว่าจะสามารถตอบสนองความต้องการด้านสุขภาพของเด็ก เยาวชน และครอบครัวได้อย่างมีประสิทธิภาพ และพร้อมที่จะปรับปรุงกลยุทธ์ดังกล่าวตามข้อเสนอแนะที่ได้รับ</li>
</ol>', 'user',
'plan note 7',  'user', 'contact 7',  'user', 'user'),

('PLAN8', 8, 'แผนสร้างเสริมสุขภาวะในองค์กร', 'Health Promotion in Organizations Plan', 'Healthy Organizations',
'ready 8', 'user', 'type_1',  'user', 
'เป้าหมายใน 3 ปีข้างหน้าคือ การบูรณาการการส่งเสริมสุขภาพเข้ากับนโยบายความปลอดภัย และอาชีว อนามัยในที่ทำงานโดยสอดคล้องกับเครือข่ายระหว่างประเทศ โครงการนี้มุ่งเน้นการบูรณาการองค์ความรู้ระดับโลก และเพิ่มขีดความสามารถของอุตสาหกรรมต่าง ๆ ในประเทศไทยให้ได้มาตรฐานสากล', 'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>การวิจัยรูปแบบการดำเนินงานของระดับนานาชาติ :</strong> ศึกษาและวิเคราะห์รูปแบบในระดับสากลของการบูรณาการการส่งเสริมสุขภาพในที่ทำงาน โดยระบุแนวปฏิบัติและกลยุทธ์ที่ประสบความสำเร็จที่สามารถปรับให้เข้ากับบริบทของสังคมไทยได้</li>
<li dir="ltr" role="presentation"><strong>ความร่วมมือกับผู้เชี่ยวชาญระดับนานาชาติ :</strong> ร่วมมือกับผู้เชี่ยวชาญระดับโลกในการส่งเสริมสุขภาพในที่ทำงานเพื่อรับข้อมูลเชิงลึก และคำแนะนํา รวมทั้งเข้าร่วมการประชุมเชิงปฏิบัติการระดับนานาชาติ และเข้าร่วมโครงการแลกเปลี่ยนความรู้เพื่อออกแบบแนวทางที่เหมาะสมกับประเทศไทย</li>
<li dir="ltr" role="presentation"><strong>พัฒนาโครงการริเริ่มและเสริมสร้างศักยภาพ :</strong> ออกแบบและดำเนินโครงการเสริมสร้างศักยภาพสำหรับเจ้าหน้าที่มูลนิธิส่งเสริมสุขภาพของประเทศไทย โดยมุ่งเน้นการปรับใช้แนวปฏิบัติระหว่างประเทศ</li>
<li dir="ltr" role="presentation"><strong>การมีส่วนร่วมของผู้มีส่วนได้ส่วนเสีย :</strong> ร่วมมือกับตัวแทนอุตสาหกรรม สหภาพแรงงาน และหน่วยงานของรัฐเพื่อหารือและบูรณาการการส่งเสริมสุขภาพเข้ากับนโยบายในสถานที่ทำงาน เพื่อให้มั่นใจว่า&nbsp; &nbsp; &nbsp; &nbsp; กลยุทธ์มีความสอดคล้องกับกฎหมายของประเทศไทย และบริบททางวัฒนธรรม</li>
<li dir="ltr" role="presentation"><strong>นําร่องการดําเนินงานในสถานที่ทำงาน :</strong> ดำเนินโครงการนําร่องในสถานที่ทำงานที่หลากหลาย เพื่อทดสอบการบูรณาการกลยุทธ์การส่งเสริมสุขภาพเข้ากับนโยบายความปลอดภัย และอาชีวอนามัยที่มีอยู่รวมทั้งติดตามการนําไปใช้ในสถานที่ทำงาน และปรับเปลี่ยนตามข้อเสนอแนะให้มีความเหมาะสม</li>
<li dir="ltr" role="presentation"><strong id="docs-internal-guid-8559d956-7fff-c75e-58da-40e03d4774d5">สร้างกรอบระดับชาติและปรับปรุงอย่างต่อเนื่อง :</strong> พัฒนากรอบระดับชาติที่ครอบคลุม พร้อมแนวทางที่มีความเป็นมาตรฐานสำหรับการนําไปปรับใช้ รวมทั้งประเมินผลของนโยบายด้านสุขภาพของพนักงาน และประสิทธิภาพขององค์กร</li>
</ol>', 'user',
'plan note 8',  'user', 'contact 8', 'user', 'user'),

('PLAN9', 9, 'แผนส่งเสริมกิจกรรมทางกาย', 'Physical Activity Promotion Plan', 'Physical Activity',
'ready 9',  'user', 'type_1',  'user', 
'มีส่วนร่วมในการกำหนดนโยบาย กลยุทธ์ และความคิดริเริ่มระดับโลกและระดับภูมิภาคที่ส่งเสริมการออกกําลังกายและเสริมสร้างเครือข่าย และแพลตฟอร์มระดับภูมิภาคที่สามารถมีอิทธิพลต่อการออกกําลังกาย',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>สร้างความร่วมมือ :</strong> เสริมสร้างความสัมพันธ์กับหน่วยงานระหว่างประเทศที่ เช่น องค์การอนามัยโลก หน่วยงานต่างๆ ของสหประชาชาติ และองค์กรภาคประชาสังคมระดับโลก เพื่อกระชับความสัมพันธ์ในการทำงานร่วมกัน</li>
<li dir="ltr" role="presentation"><strong>ริเริ่มโครงการร่วม :</strong> ริเริ่มโครงการที่สนับสนุนการเสริมสร้างศักยภาพในประเทศเพื่อนบ้าน โดยมุ่งเน้นไปที่การส่งเสริมกิจกรรมทางกาย</li>
<li dir="ltr" role="presentation"><strong>มีส่วนร่วมและให้ความสำคัญกับการวิจัย :</strong> มีส่วนร่วมอย่างแข็งขันในการวิจัยระหว่างประเทศ และให้ข้อมูลเกี่ยวกับโอกาสในการระดมทุนเพื่อช่วยการทำงานวิจัยในเรื่องของการออกกําลังกาย</li>
<li dir="ltr" role="presentation"><strong>เปิดตัวแคมเปญการสื่อสารระดับภูมิภาค :</strong> พัฒนาและใช้แคมเปญการสื่อสารโดยใช้สื่อแบบดั้งเดิม และสื่อสมัยใหม่ เพื่อสร้างความตระหนักรู้และส่งเสริมทัศนคติเชิงบวกต่อการออกกําลังกายทั่วทั้งภูมิภาค</li>
<li dir="ltr" role="presentation"><strong id="docs-internal-guid-5c1749bc-7fff-69db-147f-1fa8556c861b">ประเมินโครงการว่าสอดคล้องกับมาตรฐานสากล :</strong> ประเมินโครงการของสำนักงานกองทุนสนับสนุนการสร้างเสริมสุขภาพให้มีความสอดคล้องกับเป้าหมายการพัฒนาที่ยั่งยืนขององค์การสหประชาชาติ และแผนปฏิบัติการระดับโลกสำหรับการออกกําลังกาย พ.ศ. 2561-2573 โดยติดตามและปรับกลยุทธ์ตามความจําเป็นเพื่อให้เป็นไปตามมาตรฐานสากล</li>
</ol>', 'user',
'plan note 9',  'user', 'contact 9',  'user', 'user'),

('PLAN10', 10, 'แผนระบบสื่อและวิถีสุขภาวะทางปัญญา', 'Health Media System and Spiritual Health Pathway Plan', 'Spiritual Health',
'ready 10',  'user', 'type_1',  'user', 
'เป็นผู้นําความก้าวหน้าของการยอมรับสุขภาพทางปัญญาในภูมิภาคเอเชียตะวันออกเฉียงใต้ขององค์การอนามัยโลก โดยมุ่งเน้นการส่งเสริมให้ประเทศไทยสนับสนุนการเข้าร่วมมติด้านสุขภาพระดับภูมิภาค และวางตำแหน่งประเทศไทยให้เป็นผู้มีอิทธิพลในเชิงรุกในด้านการส่งเสริมความเป็นอยู่ที่ดีแบบองค์รวม',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>การวิจัยและการรวบรวมข้อมูล :</strong> รวบรวมงานวิจัย กรณีศึกษา และหลักฐานที่เกี่ยวข้องที่แสดงให้เห็นถึงผลกระทบเชิงบวกของสุขภาพทางปัญญาต่อความเป็นอยู่ที่ดีโดยรวม เพื่อเสริมสร้างความพยายามในการสนับสนุน</li>
<li dir="ltr" role="presentation"><strong>การมีส่วนร่วมของผู้มีส่วนได้ส่วนเสีย :</strong> มีส่วนร่วมกับผู้มีส่วนได้ส่วนเสียหลักในประเทศไทย รวมถึงบุคลากรทางการแพทย์ ผู้กำหนดนโยบาย ผู้นําทางจิตวิญญาณ และตัวแทนชุมชน เพื่อสร้างแนวร่วมสำหรับการสนับสนุน</li>
<li dir="ltr" role="presentation"><strong>พัฒนากลยุทธ์การสนับสนุน :</strong> กำหนดกลยุทธ์การสนับสนุนที่ครอบคลุมโดยให้รายละเอียดขั้นตอน ระยะเวลาในการดำเนินงาน และการมีส่วนร่วมของเป้าหมายที่ชัดเจนภายในองค์การอนามัยโลกประจำภูมิภาคเอเชียใต้และตะวันออก โดยร่วมมือกับผู้เชี่ยวชาญทั้งในและต่างประเทศ</li>
<li dir="ltr" role="presentation"><strong>สร้างความคิดริเริ่มและความร่วมมือ :</strong> สร้างความร่วมมือกับองค์กรและสถาบันที่มีแนวคิดเดียวกันเพื่อขยายความพยายามในการสนับสนุนและสร้างพันธมิตรเพื่อบูรณาการสุขภาพทางปัญญาเข้ากับมติระดับภูมิภาค</li>
<li dir="ltr" role="presentation"><strong>สร้างประเทศไทยเป็นผู้นําทางความคิด :</strong> วางตำแหน่งประเทศไทยให้เป็นผู้นําในองค์การอนามัยโลกประจำภูมิภาคเอเชียใต้และตะวันออก โดยนําเสนอหลักฐานที่รวบรวม กรณีศึกษา และมุมมองของชุมชนเกี่ยวกับสุขภาพทางปัญญา ซึ่งแสดงให้เห็นถึงความมุ่งมั่นของประเทศไทยต่อความเป็นอยู่ที่ดีแบบองค์รวม</li>
<li dir="ltr" role="presentation"><strong id="docs-internal-guid-75f7c775-7fff-ec93-9588-19c738e880e1">การมีส่วนร่วมในการสนับสนุนระดับภูมิภาค :</strong> มีส่วนร่วมในการประชุมของระดับองค์การอนามัยโลกประจำภูมิภาคเอเชียใต้และตะวันออกในระดับภูมิภาค โดยมีส่วนร่วมกับผู้มีอำนาจตัดสินใจและผู้มีส่วนได้ส่วนเสียเพื่อสนับสนุนการรวมสุขภาพทางปัญญาไว้ในมติระดับภูมิภาค</li>
</ol>', 'user',
'plan note 10',  'user', 'contact 10',  'user', 'user'),

('PLAN11', 11, 'แผนสร้างสรรค์โอกาสและนวัตกรรมสุขภาวะ', 'Health Promotion Innovation and Open Grant Plan', 'Open Grant',
'ready 11',  'user', 'type_1',  'user', 
'ส่งเสริมและเผยแพร่แนวปฏิบัติและผลลัพธ์ที่ประสบความสำเร็จจากโครงการไปยังระดับนานาชาติเพื่อส่งเสริมการแลกเปลี่ยนความรู้และความร่วมมือระดับในโลก',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>เอกสารและการวิเคราะห์ :</strong> จัดทำเอกสารและวิเคราะห์ผลลัพธ์ของแนวทางปฏิบัติที่ดีที่สุดจากโครงการต่าง ๆ อย่างเป็นระบบ โดยเน้นแนวทางที่เป็นนวัตกรรมและบทเรียนสำคัญที่ได้เรียนรู้จากโครงการนั้น</li>
<li dir="ltr" role="presentation"><strong>การพัฒนาสื่อสำหรับการเผยแพร่ :</strong> สร้างสื่อการเผยแพร่ที่ครอบคลุม เช่น กรณีศึกษาโดยละเอียด วิดีโอที่ให้ข้อมูล และเนื้อหาเว็บไซต์แบบโต้ตอบที่แสดงถึงความสำเร็จและวิธีการดำเนินงานโครงการต่าง ๆ</li>
<li dir="ltr" role="presentation"><strong>ภาคีเครือข่ายระดับโลก :</strong> เสริมสร้างและขยายเครือข่ายกับองค์กรระหว่างประเทศ มูลนิธิ และสถาบันการศึกษาที่สนใจในสาขาเดียวกัน เพื่อแบ่งปันความรู้และร่วมดำเนินโครงการในอนาคต</li>
<li dir="ltr" role="presentation"><strong>การเข้าร่วมการประชุมในระดับนานาชาติ :</strong> มีส่วนร่วมในการประชุม และการประชุมสัมมนาระดับนานาชาติเพื่อนําเสนอผลการวิจัยและแนวทางปฏิบัติจากโครงการต่าง ๆ</li>
<li dir="ltr" role="presentation"><strong>แพลตฟอร์มออนไลน์และโซเชียลมีเดีย :</strong> ใช้แพลตฟอร์มออนไลน์และช่องทางโซเชียลมีเดียเพื่อแบ่งปันการอัปเดตและข้อมูลเชิงลึกจากโครงการเหล่านี้อย่างสม่ำเสมอ ซึ่งจะทำให้การเข้าถึงสามารถเข้าถึงได้ทุกพื้นที่อย่างมีประสิทธิภาพ</li>
<li dir="ltr" role="presentation"><strong id="docs-internal-guid-7f2b616c-7fff-d684-9e18-b99665a056f3">รับฟังข้อเสนอแนะและมีการปรับปรุงอย่างต่อเนื่อง :</strong> ใช้กลไกข้อเสนอแนะเพื่อรวบรวมข้อมูลเชิงลึกจากผู้ดำเนินงานระหว่างประเทศเกี่ยวกับแนวทางปฏิบัติที่ใช้ร่วมกัน โดยใช้ข้อเสนอแนะนี้เพื่อปรับปรุงการดำเนินโครงการในอนาคต รวมทั้งปรับใช้กับกลยุทธ์เช่นเดียวกัน</li>
</ol>', 'user',
'plan note 11',  'user', 'contact 11',  'user', 'user'),

('PLAN12', 12, 'แผนสนับสนุนการสร้างเสริมสุขภาพ ผ่านระบบบริการสุขภาพ', 'Health Promotion in Health Service System Plan', 'Health Service System',
'ready 12',  'user', 'type_1',  'user', 
'มีส่วนร่วมและเรียนรู้จากเครือข่ายระดับภูมิภาคและระดับนานาชาติที่น่าสนใจ เพื่อเพิ่มการแลกเปลี่ยนความรู้ และส่งเสริมความร่วมมือ รวมทั้งรวบรวมข้อมูลเชิงลึกที่หลากหลายเข้ากับแนวปฏิบัติ',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>เข้าร่วมภาคีเครือข่าย :</strong> เข้าร่วมเครือข่ายระดับภูมิภาคและระดับนานาชาติที่เกี่ยวข้องและสอดคล้องกับประเด็นสำคัญขององค์กร</li>
<li dir="ltr" role="presentation"><strong>เข้าร่วมกิจกรรมเครือข่าย :</strong> เข้าร่วมการประชุม เวิร์คช็อป การสัมมนา และกิจกรรมเครือข่ายอื่น ๆ อย่างต่อเนื่องเพื่อรับข้อมูลเชิงลึกและแบ่งปันประสบการณ์ เพื่อส่งเสริมการเรียนรู้อย่างต่อเนื่อง</li>
<li dir="ltr" role="presentation"><strong>โครงการความร่วมมือ :</strong> เริ่มต้นโครงการความร่วมมือกับสมาชิกเครือข่ายเพื่อใช้แนวทางปฏิบัติที่ดีที่สุดและแนวทางที่เป็นนวัตกรรมใหม่ในสภาพแวดล้อมที่ใช้งานได้จริง</li>
<li dir="ltr" role="presentation"><strong>แบ่งปันความรู้ :</strong> จัดเซสชันการแบ่งปันความรู้กับสมาชิกเครือข่ายเพื่อหารือเกี่ยวกับการพัฒนา ความท้าทาย และความสำเร็จในสาขาที่เกี่ยวข้อง</li>
<li dir="ltr" role="presentation"><strong>พัฒนาความร่วมมือเพื่อการเรียนรู้ร่วมกัน :</strong> สร้างความร่วมมืออย่างเป็นทางการกับเครือข่ายหลักเพื่ออํานวยความสะดวกในการมีส่วนร่วม และสร้างโอกาสในการเรียนรู้</li>
<li dir="ltr" role="presentation"><strong id="docs-internal-guid-45d31de8-7fff-eb52-b069-31041056c712">ติดตามและประเมินผลของการมีส่วนร่วม :</strong> ติดตามและประเมินผลของการมีส่วนร่วมของภาคีเครือข่ายต่อวัตถุประสงค์ขององค์กรอย่างสม่ำเสมอ และปรับกลยุทธ์เพื่อเพิ่มประโยชน์สูงสุด</li>
</ol>', 'user',
'plan note 12',  'user', 'contact 12',  'user', 'user'),

('PLAN14', 13, 'แผนอาหารเพื่อสุขภาวะ', 'Healthy Food Promotion Plan', 'Food Promotion',
'ready 14',  'user', 'type_1',  'user', 
'เข้าร่วมและมีส่วนร่วมในการอภิปราย และสร้างเครือข่ายระหว่างประเทศที่มุ่งเน้นไปที่ระบบอาหาร เพื่อเพิ่มความเข้าใจ แบ่งปันข้อมูลเชิงลึก และสร้างอิทธิพลต่อนโยบายอาหารทั่วโลก',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>เข้าร่วมภาคีเครือข่ายที่เกี่ยวข้อง :</strong> วิจัยและเข้าร่วมภาคีเครือข่ายระหว่างประเทศที่มุ่งเน้นไปที่ระบบอาหาร เพื่อให้สอดคล้องกับเป้าหมายและความเชี่ยวชาญขององค์กร</li>
<li dir="ltr" role="presentation"><strong>การมีส่วนร่วมในการอภิปรายระหว่างกลุ่มเครือข่าย :</strong> มีส่วนร่วมในการอภิปรายระหว่างกลุ่มเครือข่าย เพื่อเพิ่มความรู้ความสามารถ รับทราบข้อมูลเชิงลึก และติดตามข่าวสารล่าสุดเกี่ยวกับแนวโน้มและนโยบายทั่วโลกที่เกี่ยวข้องกับระบบอาหาร</li>
<li dir="ltr" role="presentation"><strong>สร้างความร่วมมือ :</strong> สร้างความร่วมมือเชิงกลยุทธ์กับผู้มีส่วนได้ส่วนเสียหลัก เพื่อร่วมมือกันในโครงการ การวิจัย และสร้างความคิดริเริ่มที่มีจุดมุ่งหมายเพื่อปรับปรุงระบบอาหารทั่วโลก</li>
<li dir="ltr" role="presentation"><strong>เป็นเจ้าภาพกิจกรรมหรือเข้าร่วมกิจกรรม :</strong> จัดและ/หรือเข้าร่วมการประชุมระดับนานาชาติ เวิร์คช็อป และการสัมมนาผ่านเว็บไซต์เพื่อแบ่งปันผลการวิจัย อภิปรายความท้าทาย และส่งเสริมแนวทางปฏิบัติที่ยั่งยืนภายในระบบอาหาร</li>
<li dir="ltr" role="presentation"><strong>การเผยแพร่การเรียนรู้ :</strong> เผยแพร่การเรียนรู้และผลลัพธ์จากการอภิปรายเครือข่ายอย่างสม่ำเสมอผ่านเล่มรายงาน และนำเสนอไปยังประชาชนทั่วไป เพื่อเพิ่มการมองเห็น การเข้าถึง และการมีส่วนร่วมซึ่งกันและกัน</li>
<li dir="ltr" role="presentation"><strong id="docs-internal-guid-7a746b83-7fff-0950-9c08-7897ff94e75b">การประเมินและข้อเสนอแนะ :</strong> ประเมินของการมีส่วนร่วมในเครือข่ายที่มีต่อวัตถุประสงค์ขององค์กรอย่างต่อเนื่อง โดยใช้ข้อเสนอแนะเพื่อปรับปรุงกลยุทธ์ การมีส่วนร่วม และเพิ่มการมีส่วนร่วมในการอภิปรายนโยบายด้านอาหารทั่วโลก</li>
</ol>',  'user',
'plan note 14',  'user', 'contact 14',  'user', 'user'),

('PLAN15', 14, 'แผนสร้างเสริมความเข้าใจสุขภาวะ', 'Health Literacy Promotion Plan', 'Social Marketing',
'ready 15',  'user', 'type_1',  'user', 
'ประสบความสำเร็จในการเป็นเจ้าภาพในการจัดการประชุมระดับนานาชาติเกี่ยวกับการตลาดเพื่อสังคมเพื่อส่งเสริมการแลกเปลี่ยนความคิดด้านกลยุทธ์ ผลการวิจัยทั่วโลก เพื่อเพิ่มโอกาสในการแก้ไขปัญหาทางสังคม',  'user', 
'<ol>
<li dir="ltr" role="presentation"><strong>การวางแผนและการประสานงาน :</strong> จัดตั้งคณะกรรมการวางแผนเพื่อดูแลทุกด้านของการประชุม รวมทั้งการเลือกหัวข้อ การพัฒนาวาระการประชุม และการจัดการด้านโลจิสติกส์</li>
<li dir="ltr" role="presentation"><strong>การมีส่วนร่วมของวิทยากรและผู้เข้าร่วม :</strong> เชิญผู้เชี่ยวชาญ ผู้ปฏิบัติงาน และนักวิชาการที่มีชื่อเสียงด้านการตลาดเพื่อสังคมจากทั่วโลกมาพูดคุยในการประชุม และรับรองกลุ่มผลิตภัณฑ์ที่หลากหลายและมีความครอบคลุม</li>
<li dir="ltr" role="presentation"><strong>ความร่วมมือและการสนับสนุน :</strong> พัฒนาความร่วมมือกับสถาบันการศึกษา บริษัท และองค์กรอื่น ๆ ที่สนใจด้านการตลาดเพื่อสังคมเพื่อรับการสนับสนุนและสร้างความร่วมมือสำหรับการประชุม</li>
<li dir="ltr" role="presentation"><strong>สร้างระบบการตลาดและการส่งเสริมการขาย :</strong> ใช้กลยุทธ์ทางการตลาดที่ครอบคลุมเพื่อโปรโมทการประชุมทั่วโลก โดยใช้สื่อแบบดั้งเดิม และสื่อโซเชียลมีเดีย เพื่อให้เกิดการเข้าถึงได้โดยตรงทั้งจากผู้เข้าร่วมการประชุม และองค์กรที่มีความรู้ความสามารถ</li>
<li dir="ltr" role="presentation"><strong>การบูรณาการการใช้เทคโนโลยี :</strong> ใช้เทคโนโลยีสำหรับการลงทะเบียน การสร้างเครือข่าย และการถ่ายทอดสด เพื่อให้ผู้เข้าร่วมสามารถเข้าร่วมได้โดยสะดวก โดยผู้เข้าร่วมจากต่างประเทศที่อาจเข้าร่วมในรูปแบบเสมือนทดแทน</li>
<li dir="ltr" role="presentation"><strong id="docs-internal-guid-4c1aeb1f-7fff-52b6-c3af-8bcc14efbbb3">กิจกรรมหลังการประชุม :</strong> วางแผนกิจกรรมหลังการประชุม เช่น การเผยแพร่การดำเนินการ แบบสํารวจข้อเสนอแนะ และกิจกรรมติดตามผล เพื่อสร้างการมีส่วนร่วม และเข้าถึงข้อมูลเชิงลึกที่ได้รับระหว่างการประชุม</li>
</ol>',  'user',
'plan note 15',  'user', 'contact 15',  'user', 'user')
;

INSERT INTO plan (name, user_id,  topic, topic_en, topic_short, ir_goal_details, updated_by, for_admin) 
VALUES ('ADMIN', 15, 'แผนพัฒนาระบบและกลไกสนับสนุนเพื่อการสร้างเสริมสุขภาพ', 'Health Promotion Mechanism Development Plan', 'International Relations', 
'International Relations',
'admin', true);


-- +goose Down
ALTER TABLE plan DROP COLUMN user_id;
DROP TABLE plan;